{
  "registration_text": [
    "Please take a look at all of the classes listed below, and decide what’s right for you! ESL Registration Opens  March 23, 2026 Registration opens at 8:00 a",
    "Please take a look at all of the classes listed below, and decide what’s right for you! ESL Registration Opens  March 23, 2026 Registration opens at 8:00 a"
  ],
  "links": [],
  "full_text": "english classes - santa clara adult education skip to content login new students staff contact us about us accreditation testimonials newsletters district website silicon valley power contact us programs english classes high school diploma & high school equivalency career training wilson preschool adults with disabilities skills plus program independence network community interest classes exercise and wellness adult education credential program classes resources campus maps main campus map buchser middle school map – woodshop volunteer general policies english learner resources resources for immigrants english language resources student services college and career transition center services for adults with disabilities and learning differences calworks program family resource center career pathways area job center south bay consortium for adult education about us accreditation testimonials newsletters district website silicon valley power contact us programs english classes high school diploma & high school equivalency career training wilson preschool adults with disabilities skills plus program independence network community interest classes exercise and wellness adult education credential program classes resources campus maps main campus map buchser middle school map – woodshop volunteer general policies english learner resources resources for immigrants english language resources student services college and career transition center services for adults with disabilities and learning differences calworks program family resource center career pathways area job center south bay consortium for adult education search english classes santa clara adult education offers a variety of classes to meet your needs.  we have free english classes for adults, levels 1- 5. these english classes are for students who want to go to college, get a job, or be active in their communities. classes provide practice in speaking, listening, reading and writing. we also have free classes offered through a partnership with local community colleges. please take a look at all of the classes listed below, and decide what’s right for you! esl registration opens  march 23, 2026 registration opens at 8:00 a.m. the testing date will be assigned during registration. ways to register for the placement test in-person – visit the office at 1840 benton street, santa clara, ca 95054 online – click here to register when are classes offered? monday, tuesday, wednesday, and thursday: 9:00 am – 11:30 am tuesday, wednesday, and thursday: 6:30 pm – 9:00 pm english classes for careers english for child development english for health careers english for food service resources learning resources immigrant information have a question? adult education office 408-423-3500 [email protected] santa clara adult education offers a variety of programs to meet community needs. contact us [email protected] phone: 408-423-3500 fax: 408-423-3580 facebook instagram linkedin-in location campus map directions 1840 benton street santa clara, ca 95050 office hours monday 8:00 am – 4:00 pm tuesday – thursday: 8:00 am – 6:30 pm friday 8:00 am – 1:00 pm resources faqs california council on adult education non-discrimination policy ferpa wasc uniform complaint proceedure privacy policy ©2026 santa clara adult education – santa clara unified school district. all rights reserved. education marketing websites by akkedis digital skip to content open toolbar accessibility tools accessibility tools increase text increase text decrease text decrease text grayscale grayscale high contrast high contrast negative contrast negative contrast light background light background links underline links underline readable font readable font reset reset"
}